{
  "title": "Tech stack",
  "sub_title": "Many people ask me which tools, languages, and services I use or have used in the projects — so I gathered everything in one place.",

  "mainSpecialties": "Main specialties",
  "knownTech": "Technologies I work with",

  "frontend": "Modern and responsive interfaces",
  "backend": "Robust and scalable APIs",
  "devops": "Experience with modern infrastructure",

  "strengths": {
    "title": "Skills beyond code",
    "sub_title": "Skills I have developed along the way to build high-quality digital products.",
    "items": [
      {
        "title": "Frontend development",
        "description": "Interfaces that combine performance, accessibility, and modern design — always focused on the people who will use them."
      },
      {
        "title": "Responsive design",
        "description": "Interfaces designed with a mobile-first approach, adapted to different screen sizes, and focused on usability across all devices."
      },
      {
        "title": "Software architecture",
        "description": "Applications designed to scale: following DDD principles and engineering best practices to create scalable, organized, and sustainable architectures."
      },
      {
        "title": "Agile methodologies",
        "description": "Application of agile practices such as Navway, Scrum, and Kanban to deliver value continuously and collaboratively."
      },
      {
        "title": "Technical leadership",
        "description": "Leading development teams with a focus on quality, code standardization, technical alignment, and mentoring."
      },
      {
        "title": "Teamwork",
        "description": "Effective collaboration with different profiles — stakeholders, designers, and developers — promoting communication and joint results."
      }
    ]
  },
  "footer": {
    "title": "From code to the world: see the results",
    "message": "Skills and tools are just the beginning. What truly makes the difference is how we bring real, functional, and well-designed solutions to life. Discover some of these results on the ",
    "project": "projects page."
  }
}
