{
  "title": "Stack de tecnologia",
  "sub_title": "Muitas pessoas me perguntam quais ferramentas, linguagens e serviços eu uso e já usei no desenvolvimento dos meus projetos — então decidi reunir tudo em um só lugar.",

  "mainSpecialties": "Principais especialidades",
  "knownTech": "Tecnologias que sou familiar",

  "frontend": "Criando interfaces mdodernas e responsivas",
  "backend": "Desenvolvendo APIs robustas e escaláveis",
  "devops": "Experiência com infraestrutura moderna",

  "strengths": {
    "title": "Competências além do código",
    "sub_title": "Habilidades que desenvolvi ao longo da jornada para construir produtos digitais com qualidade.",
    "items": [
      {
        "title": "Desenvolvimento Frontend",
        "description": "Interfaces que combinam performance, acessibilidade e design moderno — tudo sempre pensado para quem realmente vai utilizar."
      },
      {
        "title": "Design Responsivo",
        "description": "Interfaces pensadas com abordagem mobile first, adaptadas para diferentes tamanhos de tela e com foco na usabilidade em qualquer dispositivo."
      },
      {
        "title": "Arquitetura de Software",
        "description": "Aplicações pensadas para crescer: seguindo princípios de DDD e boas práticas de engenharia para criar arquiteturas escaláveis, organizadas e sustentáveis."
      },
      {
        "title": "Metodologias Ágeis",
        "description": "Aplicação de práticas ágeis como Navway, Scrum e Kanban para entregar valor de forma contínua e colaborativa."
      },
      {
        "title": "Liderança Técnica",
        "description": "Coordenação de times de desenvolvimento com foco em qualidade, padronização de código, alinhamento técnico e mentorias."
      },
      {
        "title": "Trabalho em equipe",
        "description": "Colaboração eficaz com diferentes perfis profissionais, como stakeholders, designers e desenvolvedores, promovendo comunicação e resultados em conjunto."
      }
    ]
  },

  "footer": {
    "title": "Minha história não para por aqui!",
    "message": "Confira meu <b><a href=\"https://resume.ffzanini.dev\" target=\"_blank\">currículo completo</a></b> e descubra em detalhes tudo o que já produzi ao longo de mais de 10 anos de experiência na área de tecnologia."
  }
}
