{
  "title": "Por trás do código",
  "sub_title": "Minha missão é aproximar pessoas e tecnologia por meio da programação e do conteúdo digital — criando experiências que inspiram, ensinam e transformam.",
  "description": {
    "title": "A estrada até aqui",
    "begin": "Prazer! Meu nome é Felipe Frantz Zanini, engenheiro de software apaixonado por jiu-jitsu, corrida, desenvolvimento de jogos independentes, Dota 2, roteiro, pixel art, música e investimentos. Tenho 31 anos e moro em Pelotas, Rio Grande do Sul, Brasil.",
    "middle": "Minha jornada no desenvolvimento de software começou em 2008, durante o ensino técnico. Em 2010, após concluir o curso, iniciei meu primeiro estágio em programação e, desde então, nunca parei de estudar e evoluir. Ao ser efetivado como engenheiro de software, participei de mais de <b>50 projetos</b>, usando diversas tecnologias, com ênfase em PHP.",
    "education": "Apaixonado pela área e em constante busca por aprimoramento, concluí a Graduação em Tecnologia em Gestão da TI e a Especialização em Gestão de TI. Também iniciei o Mestrado em Ciência da Computação.",
    "end": "Atualmente atuo como Engenheiro de Software Sênior e Tech Lead, com foco em desenvolvimento frontend na <b><a href=\"https://www.nav9.tech\" target=\"_blank\">nav9</a></b>, onde tenho o privilégio de ser parceiro de tecnologia de empresas como <b>Shoppings Iguatemi</b>, <b>UFC Fantasy</b>, <b>EducaCross</b>, <b>Grupo SEB</b>, <b>Rede AZ</b> e <b>Vittude</b>, auxiliando-as a criar as melhores soluções de produtos para a web."
  },
  "skills": {
    "title": "Da imaginação ao impacto",
    "subtitle": "Um olhar sobre meu processo para transformar ideias em produtos digitais",
    "process": [
      {
        "id": 1,
        "title": "Entendendo a motivação",
        "description": "Tudo começa com uma boa conversa. Ouço suas ideias, entendo necessidades e motivações, traduzo isso em algo prático e penso na melhor forma de transformá-lo em algo visualmente atrativo e funcional."
      },
      {
        "id": 2,
        "title": "Montando a estrutura",
        "description": "Antes da aparência, defino a estrutura do projeto: quais páginas serão necessárias, como os elementos se comportarão e de que forma tudo ficará conectado de maneira lógica e eficiente."
      },
      {
        "id": 3,
        "title": "O código ganha vida",
        "description": "É hora de dar vida ao projeto. Desenvolvo interfaces focadas em usabilidade, responsividade e performance. Cada elemento é otimizado para funcionar bem em qualquer dispositivo, com carregamento ágil e navegação fluida."
      },
      {
        "id": 4,
        "title": "Integrações externas",
        "description": "Quando o projeto exige formulários, autenticação ou integração com outros sistemas, também assumo essa frente — sempre com foco em segurança, estabilidade e confiabilidade."
      },
      {
        "id": 5,
        "title": "Testes e garantia de qualidade",
        "description": "Antes de publicar, realizo diversos testes para garantir que tudo funcione conforme o planejado — em diferentes navegadores, dispositivos, resoluções e contextos de uso."
      },
      {
        "id": 6,
        "title": "Hora de mostrar ao mundo",
        "description": "Para fechar com chave de ouro, coloco o projeto no ar e deixo tudo pronto para acesso. Nos primeiros dias, acompanho e presto suporte para ajustar qualquer detalhe que aparecer."
      }
    ]
  },
  "stack": {
    "title": "As engrenagens por trás do processo",
    "description": "Por trás de cada clique e linha de código estão tecnologias escolhidas com cuidado e propósito. Se quiser conhecer a stack completa ou enviar uma mensagem, use os botões abaixo.",
    "button": "Ver stack completa",
    "contact": "Enviar mensagem"
  },
  "site": {
    "title": "Café, código e deploy",
    "subtitle": "Um resumo técnico das tecnologias e ferramentas que fazem deste site a minha cara — tudo o que acontece por trás dos cliques.",
    "description": "Este site foi desenvolvido com os conceitos de <b><a href='https://www.lukew.com/ff/entry.asp?1117' target='_blank'>Mobile First</a></b>, usando o framework <b><a href='https://nextjs.org/' target='_blank'>Next.js</a></b>, com deploy na <b><a href='https://vercel.com/' target='_blank'>Vercel</a></b>, estilização com <b><a href='https://tailwindcss.com/' target='_blank'>Tailwind</a></b>, animações com <b><a href='https://motion.dev/' target='_blank'>Framer-Motion</a></b> e ícones da biblioteca <b><a href='https://react-icons.github.io/react-icons/' target='_blank'>React Icons</a></b>. A tipografia é <b><a href='https://fonts.google.com/specimen/Maven+Pro' target='_blank'>Maven Pro</a></b>. Este portfólio também serve como vitrine de futuros conteúdos e laboratório de testes — onde experimento bibliotecas e ferramentas — e reúne alguns dos meus ",
    "projects": "projetos."
  }
}
