{
  "title": "Mándame un mensaje digital",
  "sub_title": "Siéntete libre en escribirme por aquí o en <b><a href='https://www.linkedin.com/in/ffzanini/' target='_blank'>LinkedIn</a></b>. Siempre estoy disponible para charlar sobre desarrollo, proyectos o lo que surja. ¡Conectemos y conversemos!",
  "form": {
    "title": "¡Manda un saludo!",
    "sub_title": "Sin middleware entre nosotros — hablemos.",
    "name": "Tu nombre",
    "email": "Correo electrónico",
    "message": "Escribe tu mensaje"
  },
  "next": {
    "title": "Próximos Pasos",
    "sub_title": "Entiende cómo funciona el proceso inicial — desde el envío de tu idea hasta la propuesta.",
    "steps": [
      {
        "id": 1,
        "title": "Envío",
        "description": "Completas el formulario con el tema de la conversación y compartes algunos detalles sobre tu idea o proyecto."
      },
      {
        "id": 2,
        "title": "Respuesta",
        "description": "En cuanto recibo tu mensaje, te respondo en un plazo de 48 horas para agendar una conversación."
      },
      {
        "id": 3,
        "title": "Alineación",
        "description": "Agendamos una reunión para alinear todos los detalles, objetivos y requisitos del proyecto."
      },
      {
        "id": 4,
        "title": "Propuesta",
        "description": "Con base en nuestra conversación, preparo una propuesta personalizada con todos los detalles para que la revises con calma."
      }
    ]
  },
  "testimonials": {
    "title": "Comentarios de quienes ya trabajaron conmigo",
    "sub_title": "Quienes han trabajado conmigo tienen algo que decir — y yo solo tengo palabras de agradecimiento.",
    "testimonials": [
      {
        "quote": "Fue gratificante ver la repercusión positiva del sitio desde su lanzamiento. ¡La recepción fue sumamente cálida! El diseño, el layout, el contenido, la navegación… todo ha sido elogiado con entusiasmo. Incluso mi padre, que echó un vistazo al código, comentó que estaba 'limpio' — ¡lo cual, viniendo de él, es un gran elogio! Solo en el lanzamiento, tuvimos más de 1.000 visitantes. He recibido mensajes destacando la organización, claridad e identidad de DOVE, que se ha fortalecido aún más con la presencia online. Estoy profundamente agradecido con el trabajo de todos los involucrados. ¡Sin duda, un éxito!",
        "name": "Joseph Murray",
        "title": "Director de DOVE Research"
      },
      {
        "quote": "Felipe fue uno de los mejores profesionales con los que tuve la oportunidad de trabajar. Siempre comprometido y 100% enfocado en entregar los proyectos con calidad, sin importar los desafíos. Se preocupa por todas las etapas del proceso de desarrollo, no se limita solo a programar. En los proyectos en los que colaboramos, desempeñaba muy bien su papel de tech lead frente al cliente, logrando grandes entregas junto al equipo. Tiene una excelente comunicación y sabe actuar en momentos difíciles. Felipe aprende con rapidez y tiene gran autonomía para liderar cualquier proyecto.",
        "name": "Igor Casconi de Oliveira",
        "title": "Ingeniero de Software"
      }
    ]
  },
  "loading": "Enviando mensaje...",
  "success": "¡Mensaje enviado con éxito!",
  "error": "Tu mensaje no fue enviado, intenta nuevamente más tarde.",
  "tooltip": "Faltan algunos campos o el correo es inválido",
  "button_text_ready": "¡Listo, solo envía!",
  "button_text_not_ready": "Esperando que completes todo...",

  "footer": {
    "title": "¡Mi historia no termina aquí!",
    "message": "Consulta mi <b><a href=\"https://resume.ffzanini.dev\" target=\"_blank\">currículum completo</a></b> y descubre en detalle todo lo que he producido en más de 10 años de experiencia en el área de tecnología."
  }
}
