{
  "title": "Stack tecnológico",
  "sub_title": "Muchas personas me preguntan qué herramientas, lenguajes y servicios uso o he usado en los proyectos — así que reuní todo en un solo lugar.",

  "mainSpecialties": "Principales especialidades",
  "knownTech": "Tecnologías con las que trabajo",

  "frontend": "Interfaces modernas y responsivas",
  "backend": "APIs robustas y escalables",
  "devops": "Experiencia con infraestructura moderna",

  "strengths": {
    "title": "Competencias más allá del código",
    "sub_title": "Habilidades que desarrollé a lo largo del camino para construir productos digitales de calidad.",
    "items": [
      {
        "title": "Desarrollo frontend",
        "description": "Interfaces que combinan rendimiento, accesibilidad y diseño moderno — siempre pensadas en quienes las van a usar."
      },
      {
        "title": "Diseño responsivo",
        "description": "Interfaces diseñadas con enfoque mobile first, adaptadas a diferentes tamaños de pantalla y centradas en la usabilidad en cualquier dispositivo."
      },
      {
        "title": "Arquitectura de software",
        "description": "Aplicaciones diseñadas para crecer: siguiendo principios de DDD y buenas prácticas de ingeniería para crear arquitecturas escalables, organizadas y sostenibles."
      },
      {
        "title": "Metodologías ágiles",
        "description": "Aplicación de prácticas ágiles como Navway, Scrum y Kanban para entregar valor de forma continua y colaborativa."
      },
      {
        "title": "Liderazgo técnico",
        "description": "Coordinación de equipos de desarrollo con foco en calidad, estandarización del código, alineación técnica y mentoría."
      },
      {
        "title": "Trabajo en equipo",
        "description": "Colaboración efectiva con distintos perfiles — stakeholders, diseñadores y desarrolladores — promoviendo comunicación y resultados conjuntos."
      }
    ]
  },
  "footer": {
    "title": "Del código al mundo: mira los resultados",
    "message": "Las competencias y herramientas son solo el comienzo. Lo que marca la diferencia es cómo damos vida a soluciones reales, funcionales y bien pensadas. Descubre algunos de estos resultados en la ",
    "project": "página de proyectos."
  }
}
